Repository: thunderbiscuit/padawan-wallet
Catalog: iOS/PadawanWallet/Resources/Localizable.xcstrings
Source language: en
Languages: es, pt

# l4_p2
source: To be made official, bitcoin miners need to mine a block that has the transaction included in it.
es: Para hacerla oficial, los mineros de bitcoin necesitan minar un bloque con la transacción incluida.
pt: Para se tornar oficial, os mineradores de bitcoin precisam minerar um bloco que inclua a sua transação nele.

# l4_p3
source: Imagine a bus coming to pick up passengers every 10 or so minutes. The bus can only take a certain amount of weight. Since every passenger is a different weight, the amount of passengers that can fit on the bus changes every time.
es: Imagina un autobús que pasa aproximadamente cada 10 minutos para recoger pasajeros. El autobús solo puede llevar un cierto peso. Como cada pasajero tiene un peso diferente, la cantidad de pasajeros que caben en el autobús cambia cada vez que realiza un viaje.
pt: Imagine um ônibus que pega passageiros a cada 10 minutos em média. O ônibus só pode levar uma determinada carga. Como cada passageiro tem um peso diferente, a quantidade de pessoas que cabem no ônibus muda toda vez.

# l4_p4
source: The mempool acts as the bus stop. A lineup of transactions wait in the mempool to be processed into a block on the blockchain. The transactions wait for their turn to be mined, and every time the bus comes by it takes as many passengers as it can fit.
es: La mempool es como si fuera la parada del autobús. Una cola de transacciones esperan en la mempool para ser procesadas en un bloque en la cadena de bloques. Las transacciones esperan su turno para ser minadas, y cada vez que viene un autobús, este recoge a todos los pasajeros que pueda.
pt: A mempool atua como um ponto de ônibus. Várias transações esperam para serem registradas em um bloco na blockchain. As transações aguardam sua vez de serem mineradas e toda vez que o ônibus passa ele leva tantos passageiros quanto possa.

# l4_p5
source: Some passengers might be in a hurry to get on the next bus. They can pay an extra fare to make sure they are near the front of the line. These transactions will be prioritized in the mining process.
es: Algunos pasajeros puede que tengan prisa para subirse al siguiente autobús. Pueden pagar una tarifa extra para asegurarse que serán de los primeros en subir. Estas transacciones son las que tendrán prioridad en el proceso de la minería.
pt: Alguns passageiros podem ter pressa em pegar o próximo ônibus. Assim, eles pagam uma tarifa mais cara para garantir que estejam perto do início da fila e consigam embarcar. Essas transações serão priorizadas no processo de mineração.

# l4_p6
source: On the other hand, some passengers might not be in a hurry at all! In that case, they might want to save their money by not paying a higher fare. Eventually, the line will clear and every transaction waiting in line does get through.
es: En cambio, ¡otros pasajeros puede que no tengan ninguna prisa! En ese caso, puede que quieran ahorrarse un poco de dinero al no pagar una tarifa extra. Con el paso del tiempo la cola se acabará vaciando y todas las transacciones que estaban esperando acabarán subiendo al autobús.
pt: Por outro lado, outros passageiros podem não ter pressa alguma! Nesse caso, eles não pagam uma tarifa mais cara. Eventualmente, a fila para entrar no ônibus terá diminuído e as transações que estão esperando serão processadas.

# l4_title
source: What is the mempool?
es: ¿Qué es la mempool?
pt: O que é a mempool?

# l5_h1
source: Bidding using transaction fees
es: La puja en las comisiones de las transacciones
pt: Disputa por espaço no bloco

# l5_h2
source: Why does the network need a light load?
es: ¿Por qué la red necesita que la carga sea ligera?
pt: Por que é importante a rede Bitcoin ser enxuta e leve?

# l5_p1
source: Now you know a little bit more about transactions. There are many, many transactions being sent, validated, confirmed, and stored in the bitcoin network every minute of every day. This is a very costly affair.
es: Ahora ya sabes un poco más sobre las transacciones. Muchas, muchas transacciones son enviadas, validadas, confirmadas y almacenadas en la red de bitcoin cada minuto de cada día. Lo que es algo muy costoso.
pt: Agora você já conhece um pouco mais sobre transações. Existem muitas delas sendo enviadas, validadas, confirmadas e armazenadas na rede do Bitcoin 24 horas por dia. Isso é bastante custoso.

# l5_p2
source: The bitcoin network can only keep up with so much demand on the system. To make sure the load on the network stays light and lean, there is a limited capacity for the total amount of bytes that can be transacted over the network per amount of time.
es: La red de bitcoin solo puede hacer frente a una demanda limitada del sistema. Para asegurarse de que la carga de la red se mantiene pequeña y ligera, hay una capacidad limitada en cuanto a la cantidad total de bytes que se pueden transaccionar a través de la red en una determinada cantidad de tiempo.
pt: A rede Bitcoin só consegue validar uma determinada demanda recebida. Para garantir que a carga na rede permaneça leve e enxuta, há uma capacidade limitada de bytes que podem ser inseridos em um bloco.

# l5_p3
source: Because the space is limited in terms of bytes per block and there is only 1 new block being mined every 10 minutes or so, bitcoin users compete for space on the blockchain by providing a fee for their transaction.
es: Como el espacio es limitado en términos de bytes por bloque y solo se mina un bloque aproximadamente cada 10 minutos, los usuarios de bitcoin compiten por el espacio en la cadena de bloques al proporcionar una comisión por sus transacciones.
pt: Como o espaço é limitado nos blocos e há apenas 1 novo bloco sendo extraído a cada 10 minutos em média, os usuários de bitcoin competem por espaço ao pagar a taxa para suas transações.

# l5_p4
source: The transactions with the highest fees are prioritized by the miners when building blocks.
es: Las transacciones con las comisiones más altas son las que tienen prioridad a la hora de construir nuevos bloques.
pt: As transações com as taxas mais altas são priorizadas pelos mineradores e inseridas prioritariamente naquele próximo bloco a ser minerado.

# l5_p5
source: One of the main advantages of the bitcoin network is its ability to stay synchronized and distributed across many computers linked to the network all over the world. The lighter and leaner the load on the network, the more resistant it is to attacks, and the more neutral and robust it stays so that all can benefit from its availability and robustness.
es: Una de las principales ventajas de la red de bitcoin es su habilidad para estar sincronizada y ser distribuida a través de muchos ordenadores conectados a la red por todo el mundo. Cuanto más pequeña y ligera sea la carga de la red, más resistente será frente a ataques, y cuanto más neutral y robusta se mantenga, más nos podremos beneficiar de su disponibilidad y robustez.
pt: Um dos pontos positivos da rede Bitcoin é permanecer sincronizada e distribuída entre muitos computadores ligados em todo o mundo. Quanto mais leve for a rede, mais resistente ela será a ataques, assim como mais neutra e robusta. Isso se deve ao fato de que pessoas comuns podem executar um Nó e ter uma cópia da rede Bitcoin e de todos os dados transacionados desde o início, pois com a rede leve ela cabe em computadores tradicionais.

# l5_title
source: What are transaction fees?
es: ¿Qué son las comisiones de transacción?
pt: O que são taxas de transação?

# l6_h1
source: Breaking it down
es: Descomponiéndolo
pt: Explicando:

# l6_h2
source: Symbols
es: Símbolos
pt: Símbolos

# l6_h3
source: Which unit should I use?
es: ¿Qué unidad debo utilizar?
pt: Qual unidade devo usar?

# l6_p1
source: The word bitcoin has a few meanings. When referring to bitcoin, people sometime mean (a) the network, the protocol, the open source project, or (b) one of the units of value when transacting on the bitcoin network.
es: La palabra bitcoin tiene varios significados. Cuando la gente se refiere a bitcoin suele significar (a) la red, el protocolo, el proyecto de código abierto, o (b) una unidad de valor cuando realizan una transacción en la red de bitcoin.
pt: A palavra bitcoin tem alguns significados. Ao se referir ao bitcoin, as pessoas às vezes querem dizer A) a rede, o protocolo, o projeto de código aberto ou B) uma das unidades de valor ao realizar transações na rede bitcoin.

# l6_p3
source: Just like the kilometer can be broken down into meters and centimeters and the foot can be broken down into inches, a bitcoin can be broken into smaller units.
es: De la misma forma que el kilómetro se puede descomponer en metros y centímetros y un pie se puede descomponer en pulgadas, un bitcoin se puede descomponer en unidades más pequeñas.
pt: Assim como o quilômetro pode ser dividido em metros e centímetros, um pé pode ser dividido em polegadas, um bitcoin pode ser dividido em unidades menores.

# l6_p4
source: The most important units to describe bitcoin are the bitcoin and the satoshi. Sometimes we shorten the bitcoin unit to "btc" and the satoshi unit to "sat". There are 100,000,000 satoshis in 1 bitcoin.
es: Las unidades de medida más importantes para describir bitcoin son el bitcoin y el satoshi. Algunas veces acortamos la unidad de bitcoin a "btc" y la unidad de satoshi a "sat". Hay 100.000.000 de satoshis en 1 bitcoin.
pt: As unidades mais importantes para descrever o bitcoin são: bitcoin e satoshi. Às vezes abreviamos a unidade bitcoin para “btc” e a unidade satoshi para “sat”. Existem 100 milhões de satoshis em 1 bitcoin.

# l6_p5
source: There is not yet an "official" symbol for either unit (bitcoin or satoshi). You may see the following symbols on Padawan or in other cryptocurrency exchanges or applications.
es: Todavía no hay un símbolo "oficial" para cada unidad de medida (bitcoin o satoshi). Puede que te encuentres con los siguientes símbolos en Padawan o en otra aplicación o intercambio de criptomonedas.
pt: Ainda não existe um símbolo “oficial” para nenhuma das unidades (bitcoin ou satoshi). Você pode ver os seguintes símbolos para bitcoin no Padawan ou em outras exchanges ou aplicativos.

# l6_p6
source: Symbols sometimes used for bitcoin:
es: Símbolos que normalmente son utilizados para bitcoin:
pt: Símbolos às vezes utilizados para representar o bitcoin:

# l6_p7
source: Symbols sometimes used for satoshis:
es: Símbolos que normalmente son utilizados para los satoshis:
pt: Símbolos às vezes utilizados para representar o satoshi:

# l6_p8
source: We often use the bitcoin (btc) or satoshi (sat) unit depending on the size of the transaction.
es: Normalmente utilizamos la unidad de medida de bitcoin (btc) o de satoshi (sat) dependiendo del tamaño de la transacción.
pt: Frequentemente usamos a unidade bitcoin (btc) ou satoshi (sat), dependendo do tamanho da transação.

# l6_p9
source: - A brand new car might be worth 1,700,000,000 sats, but it is more simple to say 1.7 bitcoin.
es: - Un coche nuevo puede que tenga un valor de 1.700.000.000 sats, pero será más sencillo decir que tiene un valor de 1.7 bitcoin.
pt: - Um carro zero Km. (no Brasil) pode valer 25.000.000 sats, só que é mais simples dizer 0,25 bitcoin.

# l6_p10
source: - You could buy a candy for 0.00000250 bitcoin, but it's much simpler to say 250 satoshis.
es: - Puedes comprar un caramelo por 0.00000250 bitcoin, pero es mucho más simple decir 250 satoshis.
pt: - Você pode comprar um doce por 0,00002700 bitcoin, só que é mais simples dizer 2700 satoshis.

# l6_p11
source: Someone using bitcoin applications must develop the skill to understand both bitcoin and satoshi units. Many transactions are denominated in bitcoin, but their network fee (see chapter 4) is almost always using the satoshi unit.
es: Quien utilice aplicaciones de bitcoin debe desarrollar la habilidad para comprender tanto la unidad de medida de bitcoin como la del satoshi. Muchas transacciones son denominadas en bitcoin, pero la comisión de la red (ver capítulo 4) casi siempre utilizará la unidad de medida de satoshis.
pt: Ao usar aplicativos/carteiras de bitcoin você deve compreender o que são as unidades bitcoin e satoshi. Muitas transações são representadas em bitcoin, mas a taxa de rede (ver capítulo 4) quase sempre usa a unidade satoshi.

# l6_p12
source: In Padawan, you can switch between the two units in the main wallet display page by touching the btc/sats symbol.
es: En Padawan, puedes cambiar entre las dos unidades de medida en la pantalla principal de la cartera pulsando el símbolo btc/sats.
pt: Na Padawan, você pode alternar entre as duas unidades na página principal de exibição da carteira tocando no símbolo btc/sats.

# l6_title
source: Bitcoin units
es: Unidades de bitcoin
pt: Unidades de bitcoin

# l7_h1
source: Padawan and backups
es: Padawan y los respaldos
pt: Padawan e backups

# l7_p1
source: You can think of your wallet as a tree, and the addresses it generates as its leaves (remember that you use a new address every time you receive bitcoin). The number of addresses that can be generated from this tree is near-infinite, but the only necessary part of backing up such a "tree of addresses" is to remember the root of the tree. Each new root will generate a completely new tree, but any wallet can recreate the whole tree simply by starting with the root.
es: Piensa que tu cartera es como un árbol, y las direcciones que genera como sus hojas (recuerda utilizar una nueva dirección cada vez que recibas bitcoin). El número de direcciones que se pueden generar a partir de este árbol son casi infinitas, pero lo único que hay que respaldar o guardar de este "árbol de direcciones" es su raíz. Cada nueva raíz generará un nuevo árbol completo, pero cualquier cartera podrá recrear el árbol completo simplemente utilizando la raíz.
pt: A sua carteira é como uma árvore e os endereços gerados são como suas folhas (lembre-se de que você usa um novo endereço toda vez que recebe bitcoin). O número de endereços que podem ser gerados a partir da árvore é quase infinito, mas a única parte necessária para fazer backup dessa “árvore de endereços” é lembrar a sua raiz. Cada nova raiz gerará uma árvore completamente nova, mas qualquer carteira pode recriar a árvore inteira simplesmente começando pela raiz.

# l7_p2
source: Modern bitcoin wallets use a process called deterministic key generation. Every new address your wallet produces is generated non-randomly. This gives them the property of being very flexible in terms of generating new addresses, while not having to remember them all individually (you do not have to make individual backups for all the addresses to which you received bitcoin).
es: Las carteras modernas de bitcoin utilizan un proceso llamado generación de claves determinista. Cada nueva dirección que produce tu cartera no se genera de forma aleatoria. Esto permite que sea muy flexible a la hora de generar nuevas direcciones, sin tener que recordarlas todas individualmente (no tienes que hacer respaldos individuales de todas las direcciones en las que hayas recibido bitcoin).
pt: As carteiras bitcoin atuais usam um processo chamado geração determinística de chaves. Cada novo endereço que sua carteira produz é gerado de forma não aleatória. Isso permite que a carteira gere novos endereços, sem que você precise se lembrar de todos individualmente (você não precisa fazer backups individuais dos endereços nos quais recebeu bitcoin).

# l7_p3
source: The "root" of your wallet is the wallet seed. This wallet seed is simply a really, really big number. But numbers are notoriously hard to remember, and humans are usually really bad at writing them down properly without making mistakes or typos.
es: La "raíz" de tu cartera es la semilla de tu cartera. Esta semilla de tu cartera es simplemente un número muy, muy grande. Pero los números son muy difíciles de recordar, y los humanos normalmente son pésimos a la hora de escribirlos correctamente sin cometer errores o equivocaciones.
pt: A “raiz” da sua carteira é a sua frase de recuperação (conhecida também como Seed). A frase de recuperação nada mais é que um número muito grande, mas números são difíceis de lembrar e geralmente há o risco de anotá-los errados.

# l7_p4
source: Instead, a standard for encoding these really big numbers has emerged in the bitcoin ecosystem. This standard uses a series of 12 or 24 words in a specific order, which together can always be used to recreate the wallet seed.
es: En su lugar, un nuevo estándar ha emergido en el ecosistema bitcoin para codificar estos números tan grandes. El estándar utiliza una serie de 12 o 24 palabras en un orden específico, que cuando se junten siempre podrán utilizarse para recrear la semilla de tu cartera.
pt: Para evitar erros ao anotar números, há um padrão no Bitcoin que codifica esses dados grandes. Ele utiliza, geralmente, uma série de 12 ou 24 palavras em uma ordem específica, que juntas são usadas para recriar a sua carteira. Sequência de palavras geralmente envolve menos riscos de anotar errado.

# l7_p5
source: Padawan uses this standard to allow users to create backups for its wallets. You'll find the 12 words (often referred to as a recovery phrase) on a separate screen under the menu options.
es: Padawan utiliza este estándar para permitir a sus usuarios que creen respaldos de sus carteras. Encontrarás las 12 palabras (conocidas comúnmente como palabras de recuperación) en una pantalla aparte dentro de las opciones del menú.
pt: Padawan usa esse padrão para permitir que os usuários criem backups (cópias de segurança) de suas carteiras. Você encontrará as 12 palavras (frase de recuperação ou Seed) em uma tela separada nas opções do menu.

# l7_p6
source: The words in your recovery phrase (or backup phrase) should be treated with the utmost care. They hold the key to all the bitcoin stored in a wallet, and they are indeed the only thing required to access all funds. We must be careful not to share this recovery phrase with potential attackers.
es: Las palabras que contengan tus palabras de recuperación o palabras de respaldo deben de ser tratadas con el máximo cuidado. Contienen la llave de todo el bitcoin almacenado en tu cartera, y son lo único que se necesita para acceder a todos los fondos. Debemos tener mucho cuidado de no compartir estas palabras de recuperación con atacantes potenciales.
pt: As palavras da sua frase de recuperação (Seed) devem ser guardadas com o máximo de cuidado. Elas contêm o acesso a todos os seus bitcoins. Não compartilhe essa frase de recuperação.

# l7_p7
source: But the value of this recovery phrase is immense: it means you can delete the application or lose your phone, and you will not lose your funds. As long as you have kept your 12-word recovery phrase safe, you can recover your wallet and all the bitcoin it holds. It is generally a good practice to write down this recovery phrase on physical objects like paper or metal (not saved on a computer) and store it in a safe place. Where/how you do this depends on how much your wallet holds and the level of security required for your use case.
es: Pero el valor de estas palabras de recuperación es inmenso: significa que puedes borrar la aplicación o perder tu teléfono y no perderás tus fondos. Mientras hayas guardado de forma segura las 12 palabras de recuperación, podrás recuperar tu cartera y todo el bitcoin que contiene. Generalmente es una buena práctica escribir estas palabras de recuperación en objetos físicos como el papel o el metal (no guardarlo o apuntarlo en ningún dispositivo electrónico como ordenadores, teléfonos móviles o fotos) y almacenarlos en un lugar seguro. Dónde y cómo lo hagas dependerá de la cantidad que tengas en tu cartera y el nivel de seguridad requerido para tu caso de uso.
pt: A importância da frase de recuperação é imensa: significa que você pode excluir o aplicativo ou perder seu telefone e não perderá seus fundos, desde que você mantenha sua frase segura, com a qual você poderá recuperar sua carteira e o saldo que ela contém. É uma boa prática anotar a frase de recuperação em objetos físicos como papel ou metal e armazená-la em local seguro (não salve em um computador ou meios online). Onde/como você fará isso vai depender de quanto sua carteira contém e do nível de segurança que você precisa.

# l7_title
source: What is a recovery phrase?
es: ¿Que son las palabras de recuperación?
pt: O que é uma frase de recuperação?

# l8_h1
source: The power of recovery phrases
es: El poder de las palabras de recuperación
pt: O poder das frases de recuperação

# l8_p1
source: Recovering a wallet from a recovery phrase is usually fairly easy. Recovery phrases (sometimes also called mnemonics) use a standard called BIP39, which provides a common way to recover coins between different wallets. The usual pattern for backing up and recovering a wallet is the following:
es: Reestablecer una cartera a partir de las palabras de recuperación es normalmente bastante fácil. Las palabras de recuperación (también conocido como frase mnemónica) utiliza un estándar llamado BIP39, el cual proporciona una forma común para recuperar tus monedas en diferentes carteras. El patrón habitual para respaldar y recuperar una cartera es el siguiente:
pt: Restaurar uma carteira a partir de uma frase de recuperação é fácil. As frases de recuperação (Seed) usam o padrão chamado BIP39, que fornece uma maneira comum de recuperar moedas entre diferentes aplicativos de carteiras bitcoin. O procedimento usual para fazer backup e recuperar uma carteira é o seguinte:

# l8_p2
source: 1. We create a wallet and the software provides us with either 12 or 24 words to write down and keep. The order of the words is important, so make sure you write them in the right order. In Padawan, you can see those 12 words at any time by going into the "Recovery phrase" screen in the menu.
es: 1. Creamos una cartera y el programa o la aplicación nos proporcionará 12 o 24 palabras para que las anotemos y las guardemos. El orden de estas palabras es importante, asique asegúrate de anotarlas en el orden correcto. En Padawan, podrás ver las 12 palabras cuando quieras entrando en la pantalla de "Palabras de recuperación" en el menú.
pt: 1. Quando uma carteira é criada, o software informa 12 ou 24 palavras para você anotar e guardar. A ordem das palavras é importante, então certifique-se de escrevê-las na ordem correta. Na Padawan, você pode ver suas 12 palavras a qualquer momento acessando a tela “Frase de recuperação” no menu.

# l8_p3
source: In most other wallets, you will only get a chance to see those words once, SO MAKE SURE YOU WRITE THEM DOWN AND TREAT THEM LIKE THE MONEY THEY REPRESENT.
es: En la mayoría de carteras, solo tendrás una oportunidad para ver las palabras, ASIQUE ASEGÚRATE DE ESCRIBIRLAS Y TRATARLAS COMO EL DINERO QUE REPRESENTAN.
pt: Na maioria das outras carteiras, você terá acesso à frase de recuperação apenas uma vez, portanto, ANOTE-AS COM CUIDADO E CUIDE DELAS COM A IMPORTÂNCIA DO DINHEIRO QUE ELAS REPRESENTAM.
